app/Controllers/Clientes.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        $clientes = $this->cliente_model->findAll();